<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b83a0990e1b0e1498730e5653281e194537e7224a249868cca355e0200511d47","plan_job_ref":"Job terraform plan #8 at https://github.com/suzutan/infra/actions/runs/7920131496","plan_out_hash":"cc06dd7d841ab0015dc8b32bdacf910eda3ef44ed80ea5f614c5a1ea5d52be94","plan_hash":"23004064549a3dad7449a82259c1b94b40a0851a589cfd9ec88a34a78efb83ff","plan_text_format":"diff","version":"1.41.2"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 5 to add, 10 to change, 5 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_access_application.argocd will be updated in-place
!~  resource "cloudflare_access_application" "argocd" {
!~      allowed_idps               = [
-           "a1b25544-0c5b-40cc-84bb-4d7a78727da3",
        ] -> (known after apply)
        id                         = "fc227815-a8eb-4701-a87c-9da5c8e94332"
        name                       = "argocd"
        tags                       = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_access_application.asf will be updated in-place
!~  resource "cloudflare_access_application" "asf" {
!~      allowed_idps               = [
-           "a1b25544-0c5b-40cc-84bb-4d7a78727da3",
        ] -> (known after apply)
        id                         = "93a53318-048d-4c75-9d4f-54a709b04327"
        name                       = "asf"
        tags                       = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_access_application.dynmap_users["mc-main-dynmap"] will be updated in-place
!~  resource "cloudflare_access_application" "dynmap_users" {
!~      allowed_idps               = [
-           "a1b25544-0c5b-40cc-84bb-4d7a78727da3",
        ] -> (known after apply)
        id                         = "6db32a88-627d-49bd-87d5-0db51cb0c8d1"
        name                       = "dynmap-users"
        tags                       = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_access_application.dynmap_users["mc-resource-dynmap"] will be updated in-place
!~  resource "cloudflare_access_application" "dynmap_users" {
!~      allowed_idps               = [
-           "a1b25544-0c5b-40cc-84bb-4d7a78727da3",
        ] -> (known after apply)
        id                         = "b242cc3c-d128-400f-9aef-4348b6fdb5f9"
        name                       = "dynmap-users"
        tags                       = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_access_application.grafana will be updated in-place
!~  resource "cloudflare_access_application" "grafana" {
!~      allowed_idps               = [
-           "a1b25544-0c5b-40cc-84bb-4d7a78727da3",
        ] -> (known after apply)
        id                         = "2b4b3ff4-100e-4c53-a0e4-7d134d8a7d9c"
        name                       = "grafana"
        tags                       = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_access_group.argocd must be replaced
-/+ resource "cloudflare_access_group" "argocd" {
!~      account_id = "3b433b4bc6b6f9770dbf88886748ec8b" -> "p.a.i.m.o.n@icloud.com" # forces replacement
!~      id         = "************************************" -> (known after apply)
        name       = "argocd"
+       zone_id    = (known after apply)

!~      include {
-           any_valid_service_token = false -> null
-           certificate             = false -> null
-           device_posture          = [] -> null
-           email                   = [] -> null
-           email_domain            = [] -> null
-           everyone                = false -> null
-           geo                     = [] -> null
-           group                   = [] -> null
-           ip                      = [] -> null
-           ip_list                 = [] -> null
-           login_method            = [] -> null
-           service_token           = [] -> null

!~          github {
!~              identity_provider_id = "************************************" -> (known after apply)
                name                 = "harvestasya"
#                (1 unchanged attribute hidden)
            }
        }

!~      require {
-           any_valid_service_token = false -> null
-           certificate             = false -> null
-           device_posture          = [] -> null
-           email                   = [] -> null
-           email_domain            = [] -> null
-           everyone                = false -> null
-           group                   = [] -> null
-           ip                      = [] -> null
-           ip_list                 = [] -> null
-           login_method            = [] -> null
-           service_token           = [] -> null
#            (1 unchanged attribute hidden)
        }
    }

  # cloudflare_access_group.asf must be replaced
-/+ resource "cloudflare_access_group" "asf" {
!~      account_id = "3b433b4bc6b6f9770dbf88886748ec8b" -> "p.a.i.m.o.n@icloud.com" # forces replacement
!~      id         = "************************************" -> (known after apply)
        name       = "asf"
+       zone_id    = (known after apply)

!~      include {
-           any_valid_service_token = false -> null
-           certificate             = false -> null
-           device_posture          = [] -> null
-           email                   = [] -> null
-           email_domain            = [] -> null
-           everyone                = false -> null
-           geo                     = [] -> null
-           group                   = [] -> null
-           ip                      = [] -> null
-           ip_list                 = [] -> null
-           login_method            = [] -> null
-           service_token           = [] -> null

!~          github {
!~              identity_provider_id = "************************************" -> (known after apply)
                name                 = "harvestasya"
#                (1 unchanged attribute hidden)
            }
        }

!~      require {
-           any_valid_service_token = false -> null
-           certificate             = false -> null
-           device_posture          = [] -> null
-           email                   = [] -> null
-           email_domain            = [] -> null
-           everyone                = false -> null
-           group                   = [] -> null
-           ip                      = [] -> null
-           ip_list                 = [] -> null
-           login_method            = [] -> null
-           service_token           = [] -> null
#            (1 unchanged attribute hidden)
        }
    }

  # cloudflare_access_group.dynmap_users must be replaced
-/+ resource "cloudflare_access_group" "dynmap_users" {
!~      account_id = "3b433b4bc6b6f9770dbf88886748ec8b" -> "p.a.i.m.o.n@icloud.com" # forces replacement
!~      id         = "************************************" -> (known after apply)
        name       = "dynmap-users"
+       zone_id    = (known after apply)

!~      include {
-           any_valid_service_token = false -> null
-           certificate             = false -> null
-           device_posture          = [] -> null
-           email                   = [] -> null
-           email_domain            = [] -> null
-           everyone                = false -> null
-           geo                     = [] -> null
-           group                   = [] -> null
-           ip                      = [] -> null
-           ip_list                 = [] -> null
-           login_method            = [] -> null
-           service_token           = [] -> null

!~          github {
!~              identity_provider_id = "************************************" -> (known after apply)
                name                 = "harvestasya"
#                (1 unchanged attribute hidden)
            }
        }

!~      require {
-           any_valid_service_token = false -> null
-           certificate             = false -> null
-           device_posture          = [] -> null
-           email                   = [] -> null
-           email_domain            = [] -> null
-           everyone                = false -> null
-           group                   = [] -> null
-           ip                      = [] -> null
-           ip_list                 = [] -> null
-           login_method            = [] -> null
-           service_token           = [] -> null
#            (1 unchanged attribute hidden)
        }
    }

  # cloudflare_access_group.grafana must be replaced
-/+ resource "cloudflare_access_group" "grafana" {
!~      account_id = "3b433b4bc6b6f9770dbf88886748ec8b" -> "p.a.i.m.o.n@icloud.com" # forces replacement
!~      id         = "************************************" -> (known after apply)
        name       = "grafana"
+       zone_id    = (known after apply)

!~      include {
-           any_valid_service_token = false -> null
-           certificate             = false -> null
-           device_posture          = [] -> null
-           email                   = [] -> null
-           email_domain            = [] -> null
-           everyone                = false -> null
-           geo                     = [] -> null
-           group                   = [] -> null
-           ip                      = [] -> null
-           ip_list                 = [] -> null
-           login_method            = [] -> null
-           service_token           = [] -> null

!~          github {
!~              identity_provider_id = "************************************" -> (known after apply)
                name                 = "harvestasya"
#                (1 unchanged attribute hidden)
            }
        }

!~      require {
-           any_valid_service_token = false -> null
-           certificate             = false -> null
-           device_posture          = [] -> null
-           email                   = [] -> null
-           email_domain            = [] -> null
-           everyone                = false -> null
-           group                   = [] -> null
-           ip                      = [] -> null
-           ip_list                 = [] -> null
-           login_method            = [] -> null
-           service_token           = [] -> null
#            (1 unchanged attribute hidden)
        }
    }

  # cloudflare_access_identity_provider.github must be replaced
-/+ resource "cloudflare_access_identity_provider" "github" {
!~      account_id = "3b433b4bc6b6f9770dbf88886748ec8b" -> "p.a.i.m.o.n@icloud.com" # forces replacement
!~      id         = "************************************" -> (known after apply)
        name       = "GitHub"
#        (1 unchanged attribute hidden)

!~      config {
!~          attributes                 = [] -> (known after apply)
!~          claims                     = [] -> (known after apply)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
!~          client_secret              = (sensitive value)
-           conditional_access_enabled = false -> null
-           pkce_enabled               = false -> null
!~          redirect_url               = "https://hvst.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
!~          scopes                     = [] -> (known after apply)
-           sign_request               = false -> null
-           support_groups             = false -> null
#            (1 unchanged attribute hidden)
        }

-       scim_config {
-           enabled                  = false -> null
-           group_member_deprovision = false -> null
-           seat_deprovision         = false -> null
-           user_deprovision         = false -> null
        }
    }

  # cloudflare_access_policy.argocd will be updated in-place
!~  resource "cloudflare_access_policy" "argocd" {
        id                             = "701bf7c7-4583-4083-bcb9-fa0938e3d794"
        name                           = "argocd"
#        (7 unchanged attributes hidden)

!~      include {
!~          group                   = [
-               "247906d8-2128-4b05-ac0f-b79e53289245",
            ] -> (known after apply)
#            (11 unchanged attributes hidden)
        }
    }

  # cloudflare_access_policy.asf will be updated in-place
!~  resource "cloudflare_access_policy" "asf" {
        id                             = "11e4ae5e-db74-4568-a9ea-619edb199449"
        name                           = "asf"
#        (7 unchanged attributes hidden)

!~      include {
!~          group                   = [
-               "8b0ce982-ea32-4daf-b8c2-64435f5ef724",
            ] -> (known after apply)
#            (11 unchanged attributes hidden)
        }
    }

  # cloudflare_access_policy.dynmap_users["mc-main-dynmap"] will be updated in-place
!~  resource "cloudflare_access_policy" "dynmap_users" {
        id                             = "8b63e387-1b8f-4da7-9cb5-f33b3f15dab1"
        name                           = "dynmap-users"
#        (7 unchanged attributes hidden)

!~      include {
!~          group                   = [
-               "5cae4bd7-9c17-4cf1-9bc6-1e84fcd77b75",
            ] -> (known after apply)
#            (11 unchanged attributes hidden)
        }
    }

  # cloudflare_access_policy.dynmap_users["mc-resource-dynmap"] will be updated in-place
!~  resource "cloudflare_access_policy" "dynmap_users" {
        id                             = "5dd6e64b-c1f2-4949-9ae5-836ab127128d"
        name                           = "dynmap-users"
#        (7 unchanged attributes hidden)

!~      include {
!~          group                   = [
-               "5cae4bd7-9c17-4cf1-9bc6-1e84fcd77b75",
            ] -> (known after apply)
#            (11 unchanged attributes hidden)
        }
    }

  # cloudflare_access_policy.grafana will be updated in-place
!~  resource "cloudflare_access_policy" "grafana" {
        id                             = "0babb04d-956a-44cf-9001-f5b699895ac3"
        name                           = "grafana"
#        (7 unchanged attributes hidden)

!~      include {
!~          group                   = [
-               "139c9ff0-23c6-42c4-994e-4025fac3ff94",
            ] -> (known after apply)
#            (11 unchanged attributes hidden)
        }
    }

Plan: 5 to add, 10 to change, 5 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #8](https://github.com/suzutan/infra/actions/runs/7920131496)